export interface Question {
  id: number;
  title: string;
  category: string;
  guidance: string;
}

export enum Category {
  SELF_AWARENESS = "self awareness",
  SELF_ACCEPTANACE = "self acceptance",
  SELF_CARE = "self care",
  SELF_LOVE = "self love",
  PURPOSE_AND_MEANING = "purpose & meaning",
}

export const questions: Question[] = [
  {
    id: 0,
    title:
      "วันไหนที่เรายิ้มกว้างสุดๆ และอะไรที่ทำให้หัวใจเราเต้นแรงได้แบบนั้น?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ลองนึกถึงวันที่เรายิ้มจากใจที่สุดนะ แล้วอะไรที่ทำให้เรารู้สึกแบบนั้นอีก?",
  },
  {
    id: 1,
    title:
      "มีวันไหนที่เราพลาดจนรู้สึกแย่บ้าง แต่สุดท้ายแล้วกลายเป็นบทเรียนดีๆ กลับมาไหม?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ลองคิดถึงวันที่เราพลาดแล้วรู้สึกแย่ แต่สุดท้ายมันกลับสอนอะไรดีๆ ให้เราบ้างนะ?",
  },
  {
    id: 2,
    title:
      "มีวันไหนที่เราพลาดจนรู้สึกแย่บ้าง แต่สุดท้ายแล้วกลายเป็นบทเรียนดีๆ กลับมาไหม?",
    category: Category.SELF_AWARENESS,
    guidance:
      "เคยมีวันที่เราพลาดจนรู้สึกแย่ แต่สุดท้ายมันกลับกลายเป็นบทเรียนสำคัญให้เราไหม?",
  },
  {
    id: 3,
    title: "ทุกวันนี้เราเอาเวลาไปใช้กับอะไร แล้วมันทำให้ชีวิตเราดีขึ้นรึเปล่า?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ลองทบทวนดูนะว่าทุกวันนี้เราใช้เวลาไปกับอะไร แล้วมันช่วยให้ชีวิตเราดีขึ้นจริงไหม?",
  },
  {
    id: 4,
    title: "วันนี้ตัวเองเป็นอย่างไร ถ้ามองจากมุมคนอื่นเข้ามา?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ลองนึกดูนะว่าถ้ามองตัวเองจากมุมมองของคนอื่น วันนี้เราดูเป็นยังไง?",
  },
  {
    id: 5,
    title: "มีอะไรเล็กๆ ที่ทำให้เราตื่นขึ้นมาแล้วยิ้มรับวันใหม่บ้าง?",
    category: Category.SELF_AWARENESS,
    guidance: "ลองคิดดูนะว่ามีอะไรเล็กๆ ที่ทำให้เราตื่นมาพร้อมรอยยิ้มได้บ้าง?",
  },
  {
    id: 6,
    title: "อีก 1 ปี เราอยากเป็นตัวเองในเวอร์ชันที่ดีที่สุดแบบไหน?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ลองคิดดูนะว่าอีก 1 ปี อยากเห็นตัวเองเป็นเวอร์ชันไหนที่รู้สึกดีที่สุด?",
  },
  {
    id: 7,
    title:
      "ถ้ามีใครก็ไม่รู้ เล่าเรื่องของเราในอนาคต อยากให้เขาพูดถึงเรายังไงบ้าง?",
    category: Category.SELF_AWARENESS,
    guidance: "ถ้ามีคนเล่าเรื่องของเราในอนาคต เราอยากให้เขาพูดถึงเราแบบไหนนะ?",
  },
  {
    id: 8,
    title: "ถ้าคำว่า ‘กลัว’ ไม่เคยมีอยู่บนโลกใบนี้ เราจะลองทำอะไรเป็นอย่างแรก?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ถ้าความกลัวไม่มีอยู่เลย เราอยากลองทำอะไรเป็นสิ่งแรกที่ใจอยากจริงๆ?",
  },
  {
    id: 9,
    title: "อะไรในหัวตอนนี้ที่เราอยากเริ่มทำเลยเพื่อตัวเราในอนาคต?",
    category: Category.SELF_AWARENESS,
    guidance:
      "ตอนนี้มีอะไรที่เราอยากเริ่มลงมือทำทันทีเพื่อสร้างอนาคตที่ดีให้ตัวเองไหม?",
  },
  {
    id: 10,
    title: "มีอะไรในตัวเองที่ทำให้รู้สึกว่า 'เฮ้ย เราก็ไม่ธรรมดา!' บ้างไหม?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ลองคิดดูนะ มีอะไรในตัวเองที่ทำให้รู้สึกว่า 'เฮ้ย เราก็เจ๋งเหมือนกัน!' บ้างไหม?",
  },
  {
    id: 11,
    title:
      "มีอะไรในตัวเองที่ยังรู้สึกขัดใจกับมันอยู่บ้าง? แล้วมันเกิดจากอะไรนะ?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ลองคิดดูนะ มีอะไรในตัวเองที่ยังรู้สึกขัดใจอยู่ แล้วมันมาจากอะไรได้บ้าง?",
  },
  {
    id: 12,
    title:
      "พร้อมปล่อยวางเรื่องในอดีตแล้วหรือยังนะ? หรือยังมีอะไรที่ยังคาใจอยู่?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ลองถามตัวเองดูนะ พร้อมปล่อยวางเรื่องในอดีตหรือยัง? หรือยังมีอะไรที่ยังติดค้างอยู่ในใจ?",
  },
  {
    id: 13,
    title:
      "เคยพยายามเปลี่ยนตัวเองเพื่อให้ใครสักคนไหม? แล้วตอนนั้นเรารู้สึกแฮปปี้จริงๆเหรอ?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "เคยเปลี่ยนตัวเองเพื่อใครสักคนไหม? แล้วตอนนั้นเรารู้สึกแฮปปี้จริงๆ หรือเปล่า?",
  },
  {
    id: 14,
    title:
      "ถ้าเพื่อนกำลังดาวน์สุดๆ เราจะพูดอะไรปลอบเขา? แล้วลองพูดแบบนั้นกับตัวเองดูบ้างรึยัง",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ถ้าเพื่อนกำลังดาวน์หนัก เราจะปลอบเขาว่ายังไง? แล้วลองพูดแบบนั้นกับตัวเองบ้างรึยัง?",
  },
  {
    id: 15,
    title:
      "ความคาดหวังที่ตั้งใจไว้ในตอนนี้ ถามจริงๆ มันแฟร์กับตัวเองแล้วรึยังนะ?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ความคาดหวังที่เราตั้งไว้ตอนนี้ ลองคิดดูดีๆ มันแฟร์กับตัวเองแล้วรึยัง?",
  },
  {
    id: 16,
    title: "เคยพูดกับตัวเองบ้างไหมว่า 'ขอบคุณนะที่สู้มาขนาดนี้' บ้างรึยัง?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "เคยบอกตัวเองไหมว่า 'ขอบคุณนะที่พยายามมาถึงตรงนี้'? ถ้ายัง ลองพูดดูสิ",
  },
  {
    id: 17,
    title: "อะไรที่ทำให้เรารู้สึกว่าไม่กล้าเป็นตัวของตัวเอง?",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "ลองคิดดูนะ อะไรที่ทำให้เรารู้สึกว่าไม่กล้าแสดงตัวตนที่แท้จริงออกมา?",
  },
  {
    id: 18,
    title: "เวลาเห็นคนอื่นดูเพอร์เฟกต์ไปหมด เราแอบคิดอะไรอยู่ในใจบ้าง?",
    category: Category.SELF_ACCEPTANACE,
    guidance: "เวลาเห็นคนอื่นดูเพอร์เฟกต์ เราเคยแอบคิดอะไรในใจบ้างไหม?",
  },
  {
    id: 19,
    title:
      "เคยลองมองจุดอ่อนของตัวเองแบบจริงจังไหม? บางทีมันอาจมีข้อดีที่เราไม่เคยสังเกตก็ได้นะ",
    category: Category.SELF_ACCEPTANACE,
    guidance:
      "เคยลองมองจุดอ่อนของตัวเองแบบจริงจังไหม? บางทีมันอาจซ่อนข้อดีที่เราไม่เคยเห็นมาก่อนก็ได้นะ",
  },
  {
    id: 20,
    title: "ทุกวันนี้เรานอนพอไหม? หรือยังฝืนตัวเองอยู่?",
    category: Category.SELF_CARE,
    guidance: "ทุกวันนี้เรานอนพอหรือเปล่า? หรือยังฝืนตัวเองเกินไปอยู่?",
  },
  {
    id: 21,
    title:
      "ช่วงนี้เรากินอะไรที่ดีต่อร่างกายบ้างไหม? หรือแค่กินตามใจปากอย่างเดียวนะ?",
    category: Category.SELF_CARE,
    guidance:
      "ช่วงนี้เราได้กินอะไรที่ดีต่อร่างกายจริงๆ ไหม? หรือแค่ตามใจปากไปเรื่อยๆ?",
  },
  {
    id: 22,
    title: "วันนี้เราออกกำลังกายบ้างยัง?",
    category: Category.SELF_CARE,
    guidance:
      "วันนี้เราได้ขยับร่าง ออกกำลังกายบ้างหรือยัง? ถ้่ายังจะเริ่มเมื่อไหร่ดีนะ",
  },
  {
    id: 23,
    title: "เวลาเราเครียด มีอะไรที่ช่วยให้เราผ่อนคลายได้แบบจริงๆ บ้างนะ?",
    category: Category.SELF_CARE,
    guidance: "เวลาเครียดสุดๆ มีอะไรที่ช่วยให้เราผ่อนคลายได้จริงๆ บ้าง?",
  },
  {
    id: 24,
    title:
      "ช่วงนี้เราได้มีเวลาสงบๆ ให้ตัวเองนั่งนิ่งๆ คิดอะไรชิลๆ บ้างรึเปล่า?",
    category: Category.SELF_CARE,
    guidance:
      "ช่วงนี้เราได้มีเวลานั่งนิ่งๆ สงบๆ ให้ตัวเองคิดอะไรสบายๆ บ้างไหม?",
  },
  {
    id: 25,
    title: "สิ่งที่เราทำทุกวันมันช่วยเติมพลัง หรือดูดพลังเราออกไปมากกว่ากันนะ?",
    category: Category.SELF_CARE,
    guidance:
      "สิ่งที่เราทำทุกวันมันช่วยเติมพลังให้เราจริงๆ หรือกลับดูดพลังเราออกไปมากกว่ากัน?",
  },
  {
    id: 26,
    title: "วันนี้มีอะไรที่ทำให้ตัวเองยิ้มออกหรือแฮปปี้บ้างรึยัง?",
    category: Category.SELF_CARE,
    guidance: "วันนี้มีอะไรที่ทำให้เรายิ้มออกหรือรู้สึกแฮปปี้บ้างหรือยัง?",
  },
  {
    id: 27,
    title: "เหนื่อยขนาดนี้ ได้หยุดพักให้ตัวเองบ้างหรือยัง?",
    category: Category.SELF_CARE,
    guidance: "เหนื่อยขนาดนี้ ได้ให้ตัวเองหยุดพักบ้างหรือยัง?",
  },
  {
    id: 28,
    title: "เวลาเรารู้สึกแย่ เราปลอบใจตัวเองว่ายังไงบ้าง?",
    category: Category.SELF_CARE,
    guidance: "เวลาเรารู้สึกแย่ เราเคยปลอบตัวเองยังไงบ้าง?",
  },
  {
    id: 29,
    title: "วันนี้มีอะไรเล็กๆ น้อยๆ ที่ทำให้เรารู้สึกดีขึ้นได้บ้างไหมนะ?",
    category: Category.SELF_CARE,
    guidance: "ลองนึกดูนะ วันนี้มีอะไรเล็กๆ ที่ช่วยให้เรารู้สึกดีขึ้นบ้างไหม?",
  },
  {
    id: 30,
    title:
      "วันนี้เราได้บอกตัวเองรึยังว่าสิ่งไหนที่เราทำได้ดี แล้วรู้สึกภูมิใจจริงๆ?",
    category: Category.SELF_LOVE,
    guidance:
      "วันนี้ลองถามตัวเองดูนะว่าเราได้บอกตัวเองหรือยังว่าสิ่งไหนที่เราทำได้ดีและภูมิใจจริงๆ?",
  },
  {
    id: 31,
    title:
      "ตอนนี้มีอะไรในตัวเองที่เราชอบมากที่สุด? เคยลองถามตัวเองดูบ้างรึยัง?",
    category: Category.SELF_LOVE,
    guidance: "ลองถามตัวเองดูนะ ตอนนี้มีอะไรในตัวเองที่เราชอบมากที่สุด?",
  },
  {
    id: 32,
    title: "เราเคยขอบคุณตัวเองสำหรับเรื่องเล็กๆ น้อยๆ ที่ทำสำเร็จบ้างไหม?",
    category: Category.SELF_LOVE,
    guidance:
      "เราเคยขอบคุณตัวเองสำหรับเรื่องเล็กๆ น้อยๆ ที่เราทำสำเร็จบ้างไหม?",
  },
  {
    id: 33,
    title:
      "เวลาเราพลาดอะไรไป เราปลอบตัวเองด้วยความเข้าใจ หรือด่าตัวเองซ้ำเข้าไปอีกนะ?",
    category: Category.SELF_LOVE,
    guidance:
      "เวลาเราพลาด เราปลอบตัวเองด้วยความเข้าใจ หรือกลับโทษตัวเองหนักกว่าเดิมนะ?",
  },
  {
    id: 34,
    title: "เราได้ตั้งขอบเขตให้ตัวเอง เพื่อเพิ่มความสุขในชีวิตบ้างรึยัง?",
    category: Category.SELF_LOVE,
    guidance: "เราได้ตั้งขอบเขตให้ตัวเอง เพื่อดูแลความสุขในชีวิตบ้างรึยัง?",
  },
  {
    id: 35,
    title:
      "มีอะไรในชีวิตที่ทำให้เรารู้สึกมีคุณค่าจริงๆ? แล้วเราได้ให้เวลากับมันมากพอรึยัง?",
    category: Category.SELF_LOVE,
    guidance:
      "มีอะไรในชีวิตที่ทำให้เรารู้สึกว่ามีคุณค่าจริงๆ? แล้วเราได้ให้เวลากับมันมากพอรึยัง?",
  },
  {
    id: 36,
    title:
      "เรายอมรับตัวเองในแบบที่เราเป็นจริงๆ หรือเรากำลังเปลี่ยนตัวเองเพื่อให้ใครพอใจรึเปล่า?",
    category: Category.SELF_LOVE,
    guidance:
      "ลองถามตัวเองดูนะว่าเรายอมรับตัวเองในแบบที่เป็นจริงๆ หรือกำลังพยายามเปลี่ยนเพื่อให้ใครพอใจอยู่รึเปล่า?",
  },
  {
    id: 37,
    title:
      "เวลาที่เรารู้สึกแย่ เราเคยปลอบตัวเองด้วยความอ่อนโยน เหมือนที่เราปลอบใจเพื่อนบ้างไหม?",
    category: Category.SELF_LOVE,
    guidance:
      "เวลาที่เรารู้สึกแย่ ลองถามตัวเองดูนะว่าเราเคยปลอบตัวเองด้วยความอ่อนโยน เหมือนที่เราปลอบเพื่อนบ้างหรือเปล่า?",
  },
  {
    id: 38,
    title: "มีอะไรที่เราทำแล้วรู้สึกว่าใจฟู มีความสุขจริงๆ บ้างไหม?",
    category: Category.SELF_LOVE,
    guidance:
      "ลองคิดดูนะ มีอะไรที่เราทำแล้วรู้สึกว่าใจฟูและมีความสุขจริงๆ บ้างไหม?",
  },
  {
    id: 39,
    title: "ถ้าเรารักตัวเองมากกว่านี้ ชีวิตเราจะแฮปปี้ขนาดไหนกันนะ?",
    category: Category.SELF_LOVE,
    guidance:
      "ลองนึกดูนะ ถ้าเรารักตัวเองมากกว่านี้ ชีวิตเราจะเปลี่ยนไปและแฮปปี้ขนาดไหน?",
  },
  {
    id: 40,
    title: "อะไรที่เราชอบทำสุดๆ แล้วทุกครั้งที่ทำรู้สึกใจฟู?",
    category: Category.PURPOSE_AND_MEANING,
    guidance: "มีอะไรที่เราชอบทำมากๆ แล้วทุกครั้งที่ทำรู้สึกใจฟูจริงๆ?",
  },
  {
    id: 41,
    title:
      "อะไรในชีวิตที่ทำให้เรารู้สึกว่า 'นี่แหละ เรามีตัวตนและมีความหมายจริงๆ'?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "ลองคิดดูนะ อะไรในชีวิตที่ทำให้เรารู้สึกว่า 'นี่แหละ เรามีคุณค่าและมีความหมายจริงๆ'?",
  },
  {
    id: 42,
    title: "ถ้าไม่มีอะไรขวางทางเราเลย เราอยากใช้ชีวิตในแบบที่ฝันไว้ยังไง?",
    category: Category.PURPOSE_AND_MEANING,
    guidance: "ถ้าไม่มีอะไรมาขวางทาง เราอยากให้ชีวิตในฝันของเราเป็นแบบไหน?",
  },
  {
    id: 43,
    title: "เคยมีฟีลแบบ 'เราเกิดมาเพื่อสิ่งนี้' ไหม? แล้วสิ่งนั้นมันคืออะไร?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "เคยมีโมเมนต์ที่รู้สึกว่า 'เราเกิดมาเพื่อทำสิ่งนี้' ไหม? แล้วสิ่งนั้นคืออะไร?",
  },
  {
    id: 44,
    title: "ถ้ามีคนในอนาคตต้องพูดถึงเรา อยากให้เขาพูดถึงเราในแบบไหน?",
    category: Category.PURPOSE_AND_MEANING,
    guidance: "ถ้ามีคนพูดถึงเราในอนาคต เราอยากให้เขาจำเราแบบไหน?",
  },
  {
    id: 45,
    title: "ความสำเร็จที่แท้จริงสำหรับเรามันควรจะเป็นยังไง?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "ความสำเร็จที่แท้จริงสำหรับเรา มันควรเป็นแบบไหนที่ทำให้เรารู้สึกภูมิใจและมีความสุข?",
  },
  {
    id: 46,
    title: "เคยทำอะไรที่ช่วยคนอื่นหรือสร้างประโยชน์ให้สังคมบ้างไหม?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "เคยมีอะไรที่เราทำแล้วช่วยคนอื่นหรือสร้างประโยชน์ให้สังคมบ้างไหม?",
  },
  {
    id: 47,
    title: "อะไรในชีวิตที่ทำให้เรารู้สึกอิ่มเอมใจและแฮปปี้สุดๆ?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "มีอะไรในชีวิตที่ทำให้เรารู้สึกอิ่มเอมใจและแฮปปี้ที่สุดจริงๆ บ้างไหม?",
  },
  {
    id: 48,
    title:
      "เป้าหมายที่ตั้งไว้ตอนนี้ มันตรงกับสิ่งที่เราให้ความสำคัญจริงๆ รึเปล่า?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "ลองคิดดูนะว่าเป้าหมายที่เราตั้งไว้ตอนนี้ มันสอดคล้องกับสิ่งที่เราให้ความสำคัญจริงๆ หรือเปล่า?",
  },
  {
    id: 49,
    title: "ถ้าสามารถเริ่มต้นชีวิตใหม่จากศูนย์ได้ อยากให้มันออกมาเป็นแบบไหน?",
    category: Category.PURPOSE_AND_MEANING,
    guidance:
      "ถ้าเริ่มต้นชีวิตใหม่จากศูนย์ได้ เราอยากให้มันเป็นแบบไหนที่เราฝันไว้?",
  },
];
